Repository: basxsoftwareassociation/basxconnect
Catalog: basxconnect/contributions/locale/*/LC_MESSAGES/django.po
Languages: de, th

source: Contributions
de: Zuwendungen
th: เงินบริจาค

source: Preferred Currency
de: Bevorzute Währung
th: สกุลเงิน

source: Date
de: Datum
th: วันที่

source: Importfile
de: Importdatei
th: นำเข้าไฟล์

source: User
de: Benutzer
th: ชื่อผู้ใช้งาน

source: Booking range
de: Buchungszeitraum
th: ช่วงการจอง

source: Number of bookings
de: Anzahl Buchungen
th: หมายเลขการจอง

source: Total amount
de: Gesamtbetrag
th: จำนวนรวม

source: Contribution Import
de: Zuwendungsimport
th: นำเข้าเงินบริจาค

source: Contributions Imports
de: Zuwendungsimporte
th: นำเข้าเงินบริจาค

source: Import
th: นำเข้า

source: Person
th: บุคคล

source: Note
de: Buchungstext
th: บันทึกเพิ่ม

source: Debit Account
de: Konto
th: บัญชีเดบิต

source: Credit Account
de: Kostenstelle
th: บัญชีเครดิต

source: Amount
de: Betrag
th: จำนวน

source: Currency
de: Währung
th: สกุลเงิน

source: Contribution
de: Zuwendung
th: เงินบริจาค

source: Import date
de: Importdatum
th: วันที่นำเข้า

source: Imports
de: Importe
th: นำเข้า

source: Upload a file
de: Datei heraufladen
th: อัพโหลดไฟล์

source: File to import
de: Zu importierende Datei
th: ไฟล์สำหรับนำเข้า

source: Choose a CSV file
de: CSV Datei auswählen
th: เลือกไฟล์ CSV

source: First line is header
de: Erste Zeile ist Kopfzeile
th: หัวเรื่องบรรทัดแรก

source: Filter out duplicates
de: Duplikate herausfiltern
th: คัดกรองรายการที่ซ้ำกัน

source: Import options
de: Importoptionen
th: ตัวเลือกการนำเข้า

source: Required field
de: Erforderliches Feld
th: จำเป็น

source: CSV import problem:
de: Problem beim CSV import:
th: เกิดปัญหาการนำเข้าCVS

source: Assignment
de: Zuweisung
th: การมอบหมาย

source: Account
de: Konto
th: บัญชี

source: Cost Center
de: Kostenstelle
th: ศูนย์ต้นทุน

source: Person Number
de: Personennummer
th: หมายเลขประจำตัว

source: Donor Number
de: Spendernummer
th: หมายเลขผู้บริจาค

source: Assignment state
de: Zuweisungsstatus
th: สถานะการมอบหมาย

source: Overview of contributions to import
de: Überblick der zu importierenden Buchungen
th: ภาพรวมของเงินบริจาคที่จะนำเข้า

source: contributions
de: Zuwendungen
th: เงินบริจาค

source: Sum
de: Summe
th: ผลรวม

source: contributions could not been assigned
de: Zuwendungen konnten nicht zugewiesen werden
th: ไม่สามารถมอบหมายเงินบริจาคได้

source: Please make sure that each entry has contributor number which matches with a person number and do the import again
de: Bitte stellen Sie sicher, dass jeder Eintrag eine Spenennummer hat welche mit der Stammnummer einer Person aus der Datenbank übereinstimmt und versuchen Sie erneut zu importieren
th: โปรดตรวจสอบให้แน่ใจว่าแต่ละรายการมีหมายเลขผู้สนับสนุนซึ่งตรงกับหมายเลขบุคคลและทำการนำเข้าอีกครั้ง

source: Cancel import
de: Import abbrechen
th: ยกเลิกการนำเข้า

source: Assignment complete
de: Zuweisung vollstängid
th: การมอบหมายเรียบร้อย

source: Continue in order to complete the import
de: Weiterfahren um den Import abzuschliessen
th: ดำเนินการต่อเพื่อดำเนินการนำเข้าให้เสร็จสมบูรณ์

source: Import contributions
de: Zuwendungen importieren
th: นำเข้าเงินบริจาค

source: Successfully imported %d contributions
de: %d Zuwendungen wurden erfolgreich importiert
th: นำเข้าเงินบริจาค%d สำเร็จแล้ว
